MyHome/src/Catalogs/ГарантияПрисоединенныеФайлы/ГарантияПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГарантияПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DocumentRef.Гарантия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <comment>Пользователь, занявший файл для редактирования</comment>
    <type>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ХранилищеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>900</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>900</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ИмяБезРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>900</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Путь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>900</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

MyHome/src/CommonModules/ОбновлениеИнформационнойБазыMyHome/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	//  имя конфигурации и номер версии на
	Описание.Имя = "MyHome";
	Описание.Версия = "0.0.3.0";
	// Требуется библиотека стандартных подсистем.
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик					 = Обработчики.Добавить();
	Обработчик.Версия			 = "0.0.3.0";
	Обработчик.Процедура		 = "ОбновлениеИнформационнойБазыMyHome.ПерейтиНаВерсию_0_0_3_0";
	Обработчик.РежимВыполнения	 = "Монопольно";
	
КонецПроцедуры

Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
	
	Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ПерейтиНаВерсию_0_0_3_0() Экспорт
	
	ПерезаполнитьРеквизитыПрисоединенныхФайлов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПерезаполнитьРеквизитыПрисоединенныхФайлов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГарантияПрисоединенныеФайлы.Ссылка КАК СсылкаНаФайл
	|ИЗ
	|	Справочник.ГарантияПрисоединенныеФайлы КАК ГарантияПрисоединенныеФайлы
	|ГДЕ
	|	ГарантияПрисоединенныеФайлы.ДатаСоздания = ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДатаПереноса = ТекущаяДата();
	ТипХранения = ПредопределенноеЗначение("Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе");
	Автор = Пользователи.ТекущийПользователь();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			ФайлОбъект								 = Выборка.СсылкаНаФайл.ПолучитьОбъект();
			ФайлОбъект.ОбменДанными.Загрузка		 = Истина;
			ФайлОбъект.Автор						 = Автор;
			ФайлОбъект.ДатаСоздания					 = ДатаПереноса;
			ФайлОбъект.ТипХраненияФайла				 = ТипХранения;
			ФайлОбъект.ДатаМодификацииУниверсальная	 = ДатаПереноса;

			ДанныеХранилища							 = ФайлОбъект.Удалить_ХранилищеФайла.Получить();
			ФайлОбъект.ФайлХранилище				 = Новый ХранилищеЗначения(ДанныеХранилища);

			ФайлОбъект.Расширение					 = СтрЗаменить(ФайлОбъект.Удалить_Расширение, ".", "");
			ФайлОбъект.ИндексКартинки				 = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(ФайлОбъект.Расширение);
			ФайлОбъект.Записать();

			МенеджерЗаписи						 = РегистрыСведений.ДвоичныеДанныеФайлов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Файл					 = ФайлОбъект.Ссылка;
			МенеджерЗаписи.ДвоичныеДанныеФайла	 = Новый ХранилищеЗначения(ДанныеХранилища);
			МенеджерЗаписи.Записать();

			НаличиеФайлов						 = РегистрыСведений.НаличиеФайлов.СоздатьМенеджерЗаписи();
			НаличиеФайлов.ОбъектСФайлами		 = ФайлОбъект.ВладелецФайла;
			НаличиеФайлов.ЕстьФайлы				 = Истина;
			НаличиеФайлов.Записать();		
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
